<a href="https://colab.research.google.com/github/Konoko2004/TheProject/blob/main/imdb_playbook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
new_df = pd.read_csv("https://raw.githubusercontent.com/Konoko2004/TheProject/main/IMDB_movie_reviews_details.csv")
new_df

     Unnamed: 0                      name  ...      votes     gross
0             0  The Shawshank Redemption  ...  2,394,059   $28.34M
1             1             The Godfather  ...  1,658,439  $134.97M
2             2           Soorarai Pottru  ...     78,266       NaN
3             3           The Dark Knight  ...  2,355,907  $534.86M
4             4    The Godfather: Part II  ...  1,152,912   $57.30M
..          ...                       ...  ...        ...       ...
995         995    Breakfast at Tiffany's  ...    169,575       NaN
996         996                     Giant  ...     34,759       NaN
997         997                     Shane  ...     37,753   $20.00M
998         998     From Here to Eternity  ...     44,086   $30.50M
999         999                  Lifeboat  ...     26,903       NaN

[1000 rows x 10 columns]

In [3]:

# checks for problematic data
def count_missing(vector):

  null_vec = pd.isnull(vector)
  return np.sum(null_vec)

def prop_missing(vec):
  num = count_missing(vec)

  denominator = vec.size

  return num / denominator

def prop_complete(vector):
  
  return 1 - prop_missing(vector)



#functions

def multiply(a,b):
  return a*b

def avg(x,y):
  return (x+y)/2

#Count a particular column for null values
def count_nan(vector):
  null_vec = pd.isnull(vector)
  null_count = np.sum(null_vec)
  return null_count

In [4]:
new_df.apply(count_missing)
#new_df.apply(prop_missing)
#new_df.apply(prop_complete)

Unnamed: 0      0
name            0
year            0
runtime         0
genre           0
rating          0
metascore     159
timeline        0
votes           0
gross         171
dtype: int64

In [10]:
#Rows with Null values in "gross" column.
new_df.loc[pd.isnull(new_df['gross']),:]

no_nan_df = new_df.dropna()
no_nan_df.apply(count_missing)

proper_df = no_nan_df.set_index(['year'])
proper_df['metascore'].rolling(window = 5).apply(lambda x : np.sum(x))            # this is a moving sum of past 5 metascores.

year
1994      NaN
1972      NaN
2008      NaN
1974      NaN
1957    450.0
        ...
1970    380.0
1967    369.0
1964    375.0
1953    368.0
1953    376.0
Name: metascore, Length: 747, dtype: float64

In [11]:
new_df
#year is a string, we need to convert it to int
#Due to year column having letters and empty space, we need to clean them first.

new_df['year'].replace('[a-zA-Z]*','',regex = True, inplace = True)             #because some years had letters, we need to remove them. Using Regex to remove.
new_df['year'].replace(' ','',inplace = True)                                   #because some years had empty spaces too, we replace them as well.
new_df['year'] = new_df['year'].astype(int)                                                      #i must reassign year column to astype(int).



#highest rated drama in year 2020
#select year and genre
year = 2020
genre = 'Drama'


highest_rated = new_df[(new_df['genre'] == genre) & (new_df['year']==year)]
highest_rated = highest_rated.sort_values('rating',ascending = False)
highest_rated.iloc[[0]]

   Unnamed: 0             name  ...   votes  gross
2           2  Soorarai Pottru  ...  78,266    NaN

[1 rows x 10 columns]

In [59]:
# return the higest rating of each unique genre

genre_group = new_df.groupby(['genre'])

genre_grouping = new_df[['name','genre','rating']].groupby('genre')

genre_grouping.max()

                                                   name  rating
genre
Action, Adventure                 The Dark Knight Rises     8.4
Action, Adventure, Biography  Aguirre, the Wrath of God     7.9
Action, Adventure, Comedy                Thor: Ragnarok     8.2
Action, Adventure, Crime                      Celda 211     7.6
Action, Adventure, Drama                   The Revenant     8.9
...                                                 ...     ...
Mystery, Romance, Thriller                      Vertigo     8.3
Mystery, Sci-Fi, Thriller                    12 Monkeys     8.0
Mystery, Thriller                         The Vanishing     8.5
Thriller                                Wait Until Dark     7.8
Western                          The Outlaw Josey Wales     8.8

[203 rows x 2 columns]

In [12]:
#work in progress
#highest rated in each genre for year 2019

year_2 = 2019

t = new_df.sort_values(['year','genre','rating'], ascending = [True,True,False])          #to get top x of each category, first we need to sort the dataframe prior to groupby.
highest_genre_rated = new_df[new_df['year']==year_2][['genre','rating']].groupby('genre').head().reset_index()
t

     Unnamed: 0                           name  ...    votes   gross
331         331    The Cabinet of Dr. Caligari  ...   58,456     NaN
129         129                        The Kid  ...  116,234  $5.45M
577         577                      Nosferatu  ...   90,046     NaN
194         194                   Sherlock Jr.  ...   43,586  $0.98M
193         193                  The Gold Rush  ...  103,171  $5.45M
..          ...                            ...  ...      ...     ...
92           92                     The Father  ...   59,314     NaN
621         621     The Trial of the Chicago 7  ...  145,173     NaN
91           91              Dara of Jasenovac  ...   34,568     NaN
146         146   Zack Snyder's Justice League  ...  288,549     NaN
579         579  The Mitchells vs the Machines  ...   43,128     NaN

[1000 rows x 10 columns]

In [ ]:
new_df['gross'].apply(count_nan)

0      0
1      0
2      1
3      0
4      0
      ..
995    1
996    1
997    0
998    0
999    1
Name: gross, Length: 1000, dtype: int64

In [ ]:
#functions

def multiply(a,b):
  return a*b

def avg(x,y):
  return (x+y)/2

#Count a particular column for null values
def count_nan(vector):
  null_vec = pd.isnull(vector)
  null_count = np.sum(null_vec)
  return null_count

In [ ]:
#return the label of the max value in a groupby function.
asd = new_df.groupby('name')['metascore'].sum()
print(asd.idxmax() +' ' + str(asd.max()))

Scarface 152.0